app/Http/Controllers/Frontend/CartController.php

    public function storeCoupon(UserCouponRequest $request)
    {
        $coupon = $request->coupon;
        $check = Coupon::where('coupon', $coupon)->first();
---
select * from `coupons` where `coupon` = 'New New' limit 1