app/Utilities/helpers.php

select * from `site_settings` limit 1
---
    function siteSetting($value)
    {
        $sitesInfo = SiteSetting::first();