app/Repositories/CartRepository.php

select `shipping_charge`, `vat` from `settings` limit 1
---
    public function showSetting()
    {
        return Setting::select('shipping_charge', 'vat')->first();