app/Repositories/CouponRepository.php

select `id`, `coupon`, `discount` from `coupons` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `coupons`
---
    public function index()
    {
        return Coupon::select('id', 'coupon', 'discount')
            ->orderBy('created_at', 'DESC')
            ->paginate(10);

insert into `coupons` (`coupon`, `discount`, `updated_at`, `created_at`) values ('New New', '100', '2023-01-18 20:33:38', '2023-01-18 20:33:38')
---
    public function store($request)
    {
        $coupon = new Coupon();

        $coupon->coupon = $request->coupon;
        $coupon->discount = $request->discount;
        $coupon->save();