app/Repositories/DashboardRepository.php

select sum(`amount`) as aggregate from `orders` where `status_op` = 3
---
    public function totalSales()
    {
        return Order::select('amount', 'created_at')
            ->where('status_op', 3)
            ->sum('amount');

select sum(`amount`) as aggregate from `orders` where date(`created_at`) = '2023-01-18' and `status_op` = 3
---
    public function todaysSales()
    {
        return Order::select('amount', 'created_at')
            ->whereDate('created_at', date('Y-m-d'))
            ->where('status_op', 3)
            ->sum('amount');

select sum(`amount`) as aggregate from `orders` where `created_at` between '2023-01-16 00:00:00' and '2023-01-22 23:59:59' and `status_op` = 3
---
    public function currentWeekSales()
    {
        return Order::select('amount', 'created_at')
            ->whereBetween('created_at', [Carbon::now()->startOfWeek(), Carbon::now()->endOfWeek()])
            ->where('status_op', 3)
            ->sum('amount');

select sum(`amount`) as aggregate from `orders` where month(`created_at`) = '01' and year(`created_at`) = '2023' and `status_op` = 3
---
    public function currentMonthSales()
    {
        return Order::select('amount', 'created_at')
            ->whereMonth('created_at', date('m'))
            ->whereYear('created_at', date('Y'))
            ->where('status_op', 3)
            ->sum('amount');

select sum(`amount`) as aggregate from `orders` where year(`created_at`) = '2023' and `status_op` = 3
---
    public function currentYearSales()
    {
        return Order::select('amount', 'created_at')
            ->whereYear('created_at', date('Y'))
            ->where('status_op', 3)
            ->sum('amount');