app/Repositories/FrontProductRepository.php

    public function productView($slug)
    {
        return Product::with('category', 'subcategory', 'brand')
            ->where('slug', $slug)
            ->get()->first();
---
select * from `brands` where `brands`.`id` in (4)
select * from `categories` where `categories`.`id` in (19)
select * from `products` where `slug` = 'rice-cooker-tefal-rk101370'

    public function addProductCart($request, $slug)
    {
        $product = Product::select('id', 'product_title', 'discount_price', 'selling_price', 'image_one')
            ->where('slug', $slug)->first();
---
select `id`, `product_title`, `discount_price`, `selling_price`, `image_one` from `products` where `slug` = 'australian-by-lalpina-logo-polo-shirt-dark-navy' limit 1

    public function products()
    {
        return Product::where('status', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'hot_deal', 'best_seller', 'special_offer', 'trand', 'new_arrival')
            ->orderBy('created_at', 'DESC')
            ->paginate(12);
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `hot_deal`, `best_seller`, `special_offer`, `trand`, `new_arrival` from `products` where `status` = 1 order by `created_at` desc limit 12 offset 12
select count(*) as aggregate from `products` where `status` = 1