app/Repositories/FrontPostRepository.php

select * from `admins` where `admins`.`id` in (1)
select * from `post_categories` where `post_categories`.`id` in (5)
select * from `posts` where `status` = 1 and `slug` = 'about-company11' limit 1
---
    public function singlePost($slug)
    {
        return Post::with('admin', 'postcategory')
            ->where('status', 1)
            ->where('slug', $slug)->first();