app/Repositories/HomeRepository.php

    public function sliders()
    {
        return Slider::where('status', 1)
            ->select('id', 'title', 'description', 'image')
            ->get();
---
select `id`, `title`, `description`, `image` from `sliders` where `status` = 1

    public function products()
    {
        return Product::where('status', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'hot_deal', 'best_seller', 'special_offer', 'trand', 'new_arrival')
            ->orderBy('created_at', 'DESC')
            ->limit(10)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `hot_deal`, `best_seller`, `special_offer`, `trand`, `new_arrival` from `products` where `status` = 1 order by `created_at` desc limit 10

    public function hotDeal()
    {
        return Product::where('status', 1)->where('hot_deal', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'hot_deal')
            ->orderBy('created_at', 'DESC')
            ->limit(3)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `hot_deal` from `products` where `status` = 1 and `hot_deal` = 1 order by `created_at` desc limit 3

    public function bestSeller()
    {
        return Product::where('status', 1)->where('best_seller', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'best_seller')
            ->orderBy('created_at', 'DESC')
            ->limit(10)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `best_seller` from `products` where `status` = 1 and `best_seller` = 1 order by `created_at` desc limit 10

    public function trand()
    {
        return Product::where('status', 1)->where('trand', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'trand')
            ->orderBy('created_at', 'DESC')
            ->limit(10)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `trand` from `products` where `status` = 1 and `trand` = 1 order by `created_at` desc limit 10

    public function posts()
    {
        return Post::where('status', 1)
            ->select('title_en', 'slug', 'description_en', 'image', 'created_at')->orderBy('created_at', 'DESC')
            ->limit(6)->get();
---
select `title_en`, `slug`, `description_en`, `image`, `created_at` from `posts` where `status` = 1 order by `created_at` desc limit 6

    public function newArrival()
    {
        return Product::where('status', 1)->where('new_arrival', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'new_arrival')
            ->orderBy('created_at', 'DESC')->limit(10)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `new_arrival` from `products` where `status` = 1 and `new_arrival` = 1 order by `created_at` desc limit 10

    public function brands()
    {
        return Brand::select('id', 'slug', 'logo')->orderBy('created_at', 'DESC')->limit(20)->get();
---
select `id`, `slug`, `logo` from `brands` order by `created_at` desc limit 20

    public function parentCategories()
    {
        return Category::whereNull('category_id')
            ->select('id', 'name', 'slug')
            ->orderBy('created_at', 'DESC')
            ->limit(9)->get();
---
select `id`, `name`, `slug` from `categories` where `category_id` is null order by `created_at` desc limit 9

    public function specialOffer()
    {
        return Product::where('status', 1)->where('special_offer', 1)
            ->select('id', 'product_title', 'slug', 'selling_price', 'discount_price', 'image_one', 'special_offer')
            ->orderBy('created_at', 'DESC')->limit(3)->get();
---
select `id`, `product_title`, `slug`, `selling_price`, `discount_price`, `image_one`, `special_offer` from `products` where `status` = 1 and `special_offer` = 1 order by `created_at` desc limit 3